{
  "backend/main.mo": "Empty Motoko actor with no implemented functions.",
  "feature_evidence.json": "Feature evidence report describing removal of a footer credit and listing affected files and components.",
  "frontend-file-summaries.txt": "Reference file containing prewritten summaries for all major frontend components and effects.",
  "frontend/index.css": "Tailwind base stylesheet defining OKLCH theme variables and light/dark mode tokens.",
  "frontend/index.html": "Basic HTML document mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Root React component that renders the LunchInviteFlow within a full-height layout.",
  "frontend/src/features/lunch-invite/effects/ConfettiEffect.tsx": "Generates falling confetti or broken-heart shapes based on the selected variant.",
  "frontend/src/features/lunch-invite/effects/FloatingBrokenHearts3D.tsx": "Creates animated floating broken-heart elements with random drift and rotation.",
  "frontend/src/features/lunch-invite/effects/FloatingHearts3D.tsx": "Creates animated floating heart emojis with randomized movement properties.",
  "frontend/src/features/lunch-invite/LunchInviteFlow.tsx": "Controls slide state transitions for the multi-step lunch invite flow, handling answers and routing between slides.",
  "frontend/src/features/lunch-invite/slides/EndScreen.tsx": "Final results slide showing message, emoji, and effects based on the user's selection with a restart button.",
  "frontend/src/features/lunch-invite/slides/ImageSlide.tsx": "Displays a generated image and provides a button to continue to the next slide.",
  "frontend/src/features/lunch-invite/slides/imageSlideMap.ts": "Maps Q2 answer keys to their corresponding generated image asset paths.",
  "frontend/src/features/lunch-invite/slides/Q1.tsx": "First question slide with yes/no options triggering navigation.",
  "frontend/src/features/lunch-invite/slides/Q2.tsx": "Second question slide offering four guessing options with distinct styling.",
  "frontend/src/features/lunch-invite/slides/Q3.tsx": "Third question slide offering three final response options.",
  "frontend/src/features/lunch-invite/SlideShell.tsx": "Layout wrapper providing consistent card styling and padding around slide content.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current Internet Identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides context and hooks for Internet Identity authentication, including login, logout, and identity loading via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend queries are needed.",
  "frontend/src/index.css": "Tailwind base styles, color variables, animations, and thematic effects like confetti and floating hearts.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind configuration extending theme colors, animations, and plugins for styling.",
  "project_state.json": "JSON metadata describing project version, features, architecture notes, and known issues."
}